#имя проекта: numpy-example
#номер версии: 1.0
#имя файла: example_1.py
#автор и его учебная группа: И.Тушин, ЭУ-142
#дата создания: 27.04.2019
# дата последней модификации: 27.04.2019
#связанные файлы: пакеты numpy, matplotlib
# описание: Создать прямоугольную матрицу A, имеющую N строк и M столбцов со
# случайными элементами. Найти наибольшее значение среди средних
# значений для каждой строки матрицы.
#версия Python: 3.6

import numpy as np
import random

N= random.randint (1,10)
M= random.randint (1,10)

print(N,M)
A=np.random.randint(0,10, (N,M))

print(A)

mx=0
aver=0
for i in range (N):
    if np.mean (A[i , :])> mx:
        mx= np.mean(A[i , :])
        aver=i
print("Строка с максимальным средним значением элементов-"+ str(A[aver , :]))
print("Среднее значение этой строки-"+str(mx)+ ","+ "номер этой строки-"+ str(aver+1))

